# Структура уровня:
# {
#     "player_start": (x, y),
#     "goal": (x, y),
#     "platforms": [(x, y, width, height, type, move_range), ...],
#     "enemies": [(x, y, patrol_range), ...]
# }

levels = [
  # Уровень 1 - Начало, обучение
    {
        "player_start": (100, 500), # Точка спавна
        "goal": (900, 300), # Финиш
        "platforms": [
            (0, 600, 1000, 100, "normal", 0),  # Земля
            (200, 500, 200, 30, "normal", 0),  # Обычная платформа
            (500, 450, 200, 30, "normal", 0),
            (800, 400, 200, 30, "normal", 0),
        ],
        "enemies": []
    },

   # Уровень 2 - Первые враги
    {
        "player_start": (100, 500),
        "goal": (1510, 250),
        "platforms": [
            (0, 600, 1700, 100, "normal", 0),
            (300, 500, 150, 30, "normal", 0),
            (600, 450, 150, 30, "normal", 0),
            (800, 450, 150, 30, "normal", 0),
            (1100, 400, 150, 30, "normal", 0),
            (1400, 350, 200, 30, "normal", 0),
        ],
        "enemies": [
            (760, 410, 100),
        ]
    },

    # Уровень 3 - Движущиеся платформы
    {
        "player_start": (100, 500),
        "goal": (1700, 100),
        "platforms": [
            (0, 600, 2000, 100, "normal", 0),
            (200, 500, 50, 30, "normal", 0),
            (250, 400, 50, 30, "normal", 0),
            (300, 300, 50, 30, "normal", 0),
            (350, 200, 150, 30, "normal", 0),
            (600, 200, 150, 30, "moving", 100), # Движущаяся платформа
            (850, 200, 300, 30, "normal", 0),
            (1250, 200, 150, 30, "moving", 100),
            (1500, 200, 300, 30, "normal", 0),
        ],
        "enemies": [
            (980, 160, 100), # Враг
            (350, 350, 100),
        ]
    },
